Revit 2026 API

# ViewScheduleExportOptions(ViewScheduleExportOptions) Constructor

---

Constructs a new copy of the input ViewScheduleExportOptions object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ViewScheduleExportOptions(
	ViewScheduleExportOptions other
)
```
```vb
Public Sub New (
	other As ViewScheduleExportOptions
)
```
```cpp
public:
ViewScheduleExportOptions(
	ViewScheduleExportOptions^ other
)
```
```fsharp
new :
        other : ViewScheduleExportOptions -> ViewScheduleExportOptions
```

#### Parameters

other ViewScheduleExportOptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ViewScheduleExportOptions Class

ViewScheduleExportOptions Overload

Autodesk.Revit.DB Namespace